{
    "games": [
        {
            "id": "game1",
            "name": "Tower Swapper",
            "description": "**Created for:** GMTK Game Jam 2023 (48-hour development)\n**Theme:** Roles Reversed\n**Team Size:** 2\n**My Contributions:** Game Design, Level Design, Programming, UI, Testing\n\nTower Swapper is a unique twist on the tower defense genre, where roles are reversed. Instead of placing towers, you take control of them in first-person mode to defend the base of a computer-controlled 'player'. The AI-controlled player earns currency from your successful eliminations and strategically places and upgrades towers from a selection of four different types to counter incoming enemies.",
            "images": [
                "../../images/TS3.JPG",
                "../../images/TS2.jpg",
                "../../images/TS5.jpg"
            ]
        },
        {
            "id": "game2",
            "name": "Eggmaggedon",
            "description": "**Created for:** Mini Jam 119 (~72-hour development)\n**Theme:** Heaven (Everything Can Die)\n**Team Size:** 5\n**My Contributions:** Design and Functionality of Menus and UI, Game Design, Testing\n\nThe end is near—meteors rain from the sky, and chaos unfolds. As the Egg Harbinger, your sacred duty is to collect untainted souls and guide them to heaven. Use your dash to break through obstacles, chain soul collections in rapid succession, and rack up style points to boost your combo multiplier. Race against time, refine your strategy, and tweak the settings to unleash even more destruction in your quest for salvation.  ",
            "images": [
                "../../images/EGG6.png",
                "../../images/EGG5.PNG",
                "../../images/EGG4.PNG",
                "../../images/EGG3.PNG",
                "../../images/EGG2.png"
            ]
        },
        {
            "id": "game3",
            "name": "Mech Delivery Mayhem",
            "description": "**Created for:** MechJam III (~7 days development)\n**Theme:** Mechs (Retro)\n**Team Size:** 4\n**My Contributions:** Programming, Game Design, UI, Testing\n\nIn Mech Delivery Mayhem, you control a massive mech equipped with powerful lasers, and your mission is simple: reach each delivery destination as quickly as possible to pay your weekly rent — being a villain just isn't paying the bills anymore. Tear through the city to speed up your journey, but beware — it's fighting back! Earn enough before your power runs out and make sure you complete your deliveries in time.",
            "images": [
                "../../images/MECH2.png",
                "../../images/MECH3.gif",
                "../../images/MECH4.png",
                "../../images/MECH5.png"
            ]
        },
        {
            "id": "game4",
            "name": "Night of the Dice",
            "description": "**Created for:** GMTK Game Jam 2022 (48-hour development)\n**Theme:** Roll of the Dice\n**Team Size:** 7\n**My Contributions:** Programming, Game Design, Level and World Design, Testing\n\nNight of the Dice is a dark, atmospheric platformer where you are the dice itself. Roll it to gain unique abilities based on the face you land on, such as gravity float, bull dash, a hand that flings you away, bounce ball, double jump, and an unstoppable speed boost. Can you make it to the top and destroy the bell to end the suffering once and for all?\n\n - inspired by games like Getting Over it and Jump King",
            "images": [
                "../../images/DICE2.png",
                "../../images/DICE3.png",
                "../../images/DICE4.png",
                "../../images/DICE5.png"
            ]
        },
        {
            "id": "game5",
            "name": "Wrong Road",
            "description": "**Created for:** Ludum Dare 50 (3 days development)\n**Theme:** Delay the Inevitable\n**Team Size:** 4\n**My Contributions:** Programming, Game Design, Testing\n\nAfter a successful heist, you find yourself fleeing from the cops while your car slowly breaks down. As you drive through an endless, procedurally generated train tunnel, a new problem emerges: a speeding train. Push your car to its limits, racing to escape both the police and the oncoming train. To keep going, 'fix' your car by punching the speedometer, turning off the faulty, endlessly restarting radio, or cranking the hand crank to recharge the battery. How far can you go before everything falls apart?",
            "images": [
                "../../images/ROAD2.png",
                "../../images/ROAD3.png",
                "../../images/ROAD4.png"
            ]
        },
        {
            "id": "game6",
            "name": "Burning Light",
            "description": "**Created for:** Global Game Jam 2022 (10 days development)\n**Theme:** Duality\n**Team Size:** 9\n**My Contributions:** Programming, Game Design, Level Design, UI and Menus, Testing\n\nIn a near future ravaged by environmental disaster, the sun now shines so intensely it burns, and humanity has been enslaved by robotic overlords. Navigate your way through the main facility to end this brutal subjugation. Stay undetected, avoid the searing sunlight, and use the Lumen™ device to absorb light, activating various contraptions to solve puzzles. Immerse yourself in this atmospheric horror puzzle game as you face the ultimate challenge: defeating the end boss and reclaiming freedom.",
            "images": [
                "../../images/BL2.png",
                "../../images/BL3.png",
                "../../images/BL4.gif",
                "../../images/BL5.png",
                "../../images/BL6.png"
            ]
        },
        {
            "id": "game7",
            "name": "Cultist Deal",
            "description": "**Created for:** GMTK Game Jam 2021 (48-hour development)\n**Theme:** Joined Together\n**Team Size:** 1\n\nCultist Deal is a short puzzle platformer where you find yourself trapped in hell — quite literally — with no movement abilities. To escape, you must bind yourself to ancient pacts from old tomes, each granting you new powers. But beware — chaining yourself to multiple pacts comes with consequences, and breaking these bonds may cost you dearly. Will you navigate the infernal depths and find your way out, or become bound forever?",
            "images": [
                "../../images/CD2.png",
                "../../images/CD2.png",
                "../../images/CD3.png",
                "../../images/CD4.png",
                "../../images/CD5.gif"
            ]
        },
        {
            "id": "project1",
            "name": "Night Of Demise",
            "description": "This is a brief description of Project 1. It provides an overview of the project's goals, features, and outcomes.",
            "images": [
                "../../images/VR2.png",
                "../../images/V3.png",
                "../../images/V4.png",
                "../../images/VR5.png",
                "../../images/VR6.png",
                "../../images/VR7.png"
            ]
        },
        {
            "id": "project2",
            "name": "Worm eats World",
            "description": "This is a brief description of Project 2. It provides an overview of the project's goals, features, and outcomes.",
            "images": [
                "../../images/Worm2.png",
                "../../images/Worm3.png",
                "../../images/Worm4.png",
                "../../images/Worm5.png",
                "../../images/Worm6.png"
            ]
        },
        {
            "id": "project3",
            "name": "GameArt Project",
            "description": "This is a brief description of Project 3. It provides an overview of the project's goals, features, and outcomes.",
            "images": [
                "../../images/art2.png",
                "../../images/art3.png",
                "../../images/art4.png",
                "../../images/art5.png"
            ]
        },
        {
            "id": "project4",
            "name": "Analogue game",
            "description": "This is a brief description of Project 3. It provides an overview of the project's goals, features, and outcomes.",
            "images": [
                "../../images/19.jpg",
                "../../images/20.jpg",
                "../../images/21.jpg"
            ]
        },
        {
            "id": "prototype1",
            "name": "Prototype Name 1",
            "description": "This is a brief description of Prototype 1. It provides an overview of the prototype's purpose, features, and functionality.",
            "images": [
                "../../images/22.jpg",
                "../../images/23.jpg",
                "../../images/24.jpg"
            ]
        },
        {
            "id": "prototype2",
            "name": "Prototype Name 2",
            "description": "This is a brief description of Prototype 2. It provides an overview of the prototype's purpose, features, and functionality.",
            "images": [
                "../../images/25.jpg",
                "../../images/26.jpg",
                "../../images/27.jpg"
            ]
        },
        {
            "id": "prototype3",
            "name": "Prototype Name 3",
            "description": "This is a brief description of Prototype 3. It provides an overview of the prototype's purpose, features, and functionality.",
            "images": [
                "../../images/28.jpg",
                "../../images/29.jpg",
                "../../images/30.jpg"
            ]
        }
    ]
}